evidence/qa-automation/01-observability/step2-monitoring/k6-smoke-test-output.txt

         /\      Grafana   /ظ╛ظ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ظ╛ظ╛\ 
  /          \   |   (  |  (ظ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 3 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-05-03T19:41:50+03:00" level=info msg="≡اأ Starting Smoke Test against: https://localhost:44368" source=console
time="2026-05-03T19:41:50+03:00" level=info msg="≡اôè Test will run for 1 minute with 3 virtual users" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2026-05-03T19:41:54+03:00" level=error msg="ظإî Health check failed! Status: 404" source=console
time="2026-05-03T19:41:54+03:00" level=error msg="Response: " source=console


  ظûê THRESHOLDS 

    custom_error_rate
    ظ£ô 'rate<0.01' rate=0.00%

    http_req_duration
    ظ£ù 'p(95)<500' p(95)=4.42s

    http_req_failed
    ظ£ù 'rate<0.01' rate=100.00%


  ظûê TOTAL RESULTS 

    CUSTOM
    custom_error_rate...: 0.00%   0 out of 0

    HTTP
    http_req_duration...: avg=4.42s min=4.42s med=4.42s max=4.42s p(90)=4.42s p(95)=4.42s
    http_req_failed.....: 100.00% 1 out of 1
    http_reqs...........: 1       0.222406/s

    EXECUTION
    vus.................: 0       min=0      max=0
    vus_max.............: 3       min=3      max=3

    NETWORK
    data_received.......: 1.7 kB  385 B/s
    data_sent...........: 1.8 kB  397 B/s



Run       [ 100% ] setup()
default   [   0% ]
time="2026-05-03T19:41:55+03:00" level=error msg="Error: Health check failed. Aborting test.\n\tat setup (file:///E:/%D9%85%D8%B4%D8%B1%D9%88%D8%B9%20%D8%AA%D8%AC%D8%B1%D9%8A%D8%A8%D9%8A/tests/performance/smoke.js:115:11(47))\n" hint="script exception"